//Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает обратное значение 
//1 -> 1, 2 -> 0.5, 


Console.WriteLine("Введите число:");
int a = Convert.ToInt32(Console.ReadLine());
double i = 1;
double result = i/a;
Console.WriteLine(result);
