// Напишите программу вычисления модуля числа. 2 -> 2  - 3 -> 3  -7 -> 7

Console.WriteLine("Введите число:");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Модуль числа = ");
Console.WriteLine(Math.Abs(a));
